app/views/students/enrollment_page.html.erb

SELECT "courses".* FROM "courses"
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ? AND "enrollments"."course_id" = ? LIMIT 1  [["student_id", 1], ["course_id", 5]]
---
      <tbody>
      <% Course.all.each do |course| %>
          <% @e = Enrollment.find_by(student_id: session[:current_user_id], course_id: course.id) %>