app/views/students/home.html.erb

      <tbody>
      <% Enrollment.all.select { |x| x.student_id == session[:current_user_id]}.each do |c| %>
          <tr>
            <% @courseDetails = Course.find_by id: c.course_id %>
---
SELECT "enrollments".* FROM "enrollments"
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 7]]