app/views/course_materials/index.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 2]]
---
        <td><%= course_material.message %></td>
        <td><%= Course.find_by_id(course_material.course_id).title %></td>
        <td><%= Instructor.find_by_id(course_material.instructor_id).name %></td>