app/views/instructors/add_enrollment.html.erb

  <tbody>
  <% Enrollment.all.select{|stu| stu.status == 'PENDING' and stu.course_id.to_s == params[:id].to_s}.each do |stu| %>
---
SELECT "enrollments".* FROM "enrollments"