app/views/instructors/home.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."instructor_id" = ? LIMIT 1  [["instructor_id", 2]]
---
    <tbody>
    <% Course.all.select { |x| x.instructor_id == session[:current_user_id]}.each do |c| %>