app/views/instructors/manage_student.html.erb

    <tbody>
    <% Enrollment.all.select{|stu| stu.status == 'ENROLLED' and stu.course_id.to_s == params[:id].to_s}.each do |stu| %>
        <tr>
          <% st = Student.find_by_id(stu.student_id) %>
---
SELECT "enrollments".* FROM "enrollments"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]