app/views/shared/_navigation.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 980190962]]
---
      <% if session[:user_type] == 'student' %>
          <a class="navbar-brand" href="<%= edit_student_path(Student.find(session[:current_user_id]))%>">Edit Profile</a>