app/views/courses/_form.html.erb

SELECT "instructors".* FROM "instructors"
---
      <%= f.label :instructor_id %><br>
      <%= f.select :instructor_id, options_for_select(Instructor.all.map{|s|[s.name, s.id]}),
                   {:prompt =>"Select Instructor"}, :required => true%>