app/views/courses/index.html.erb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", nil]]
---
        <td><%= course.description %></td>
            <td><%= Instructor.find(course.instructor_id).name %></td>