app/views/courses/show.html.erb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 2]]
---
              <strong>Instructor:</strong>
              <%= Instructor.find(@course.instructor_id).name %>