app/controllers/admins_controller.rb

INSERT INTO "admins" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pranav Kulkarni"], ["email", "pkulkar5@ncsu.edu"], ["password", "zxcv1234"], ["created_at", "2016-01-30 22:30:21.208673"], ["updated_at", "2016-01-30 22:30:21.208673"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

UPDATE "admins" SET "password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["password", "12345"], ["updated_at", "2016-02-07 20:45:07.464021"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @admin.update(admin_params)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 4]]
---
  def destroy
    @admin.destroy