app/controllers/course_materials_controller.rb

SELECT "course_materials".* FROM "course_materials"
---
  def index
    @course_materials = CourseMaterial.all

INSERT INTO "course_materials" ("title", "message", "course_id", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aaaaaa"], ["message", "bbb"], ["course_id", 7], ["instructor_id", 2], ["created_at", "2016-02-16 00:37:20.407922"], ["updated_at", "2016-02-16 00:37:20.407922"]]
---
  def create

    course_new_params= {}
    course_new_params[:title] = course_material_params[:title]
    course_new_params[:message] = course_material_params[:message]
    course_new_params[:course_id] =  params[:course_id]
    course_new_params[:instructor_id] = params[:instructor_id]

    @course_material = CourseMaterial.new(course_new_params)
    respond_to do |format|
      if @course_material.save

UPDATE "course_materials" SET "message" = ?, "updated_at" = ? WHERE "course_materials"."id" = ?  [["message", "yuyuyzzzzzz"], ["updated_at", "2016-02-16 00:49:43.059098"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @course_material.update(course_material_params)

SELECT  "course_materials".* FROM "course_materials" WHERE "course_materials"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_course_material
      @course_material = CourseMaterial.find(params[:id])