app/controllers/courses_controller.rb

INSERT INTO "courses" ("courseNumber", "title", "description", "instructor_id", "status", "startDate", "endDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "title" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "DBMS"], ["updated_at", "2016-02-12 23:43:40.830474"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)