app/controllers/enrollments_controller.rb

  def destroy
    @enrollment.destroy
---
DELETE FROM "enrollments" WHERE "enrollments"."id" = ?  [["id", 7]]

    def set_enrollment
      @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT 1  [["id", 7]]