app/controllers/instructors_controller.rb

INSERT INTO "instructors" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ed"], ["email", "Gehringer"], ["password", "zxcv1234"], ["created_at", "2016-01-31 22:12:09.857739"], ["updated_at", "2016-01-31 22:12:09.857739"]]
---
  def create
    @instructor = Instructor.new(instructor_params)

    respond_to do |format|
      if @instructor.save

UPDATE "instructors" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Ed G"], ["email", "ed@ncsu.edu"], ["updated_at", "2016-02-07 21:24:45.173203"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @instructor.update(instructor_params)

DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 1]]
---
  def destroy
    @instructor.destroy

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_instructor
      @instructor = Instructor.find(params[:id])

SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ? AND "enrollments"."course_id" = ? LIMIT 1  [["student_id", 1], ["course_id", 5]]
UPDATE "enrollments" SET "status" = ?, "updated_at" = ? WHERE "enrollments"."id" = ?  [["status", "ENROLLED"], ["updated_at", "2016-02-14 00:40:41.318896"], ["id", 1]]
---
    def enroll_student
      @student_id_list = params[:student_ids]
      if @student_id_list == nil
          flash[:notice] = 'Please select student(s)!'
          redirect_to '/instructors/land/add_enrollment/' + params[:tokenCourseId].to_s
      else
      @student_id_list.each do |x|
        e = Enrollment.find_by(student_id: x, course_id: params[:tokenCourseId])
        puts e.student_id.to_s + "  " + e.status.to_s
        e.status = "ENROLLED"
        e.save