app/controllers/logins_controller.rb

INSERT INTO "students" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Vivek R"], ["email", "vr@ncsu.edu"], ["password", "1"], ["created_at", "2016-02-15 22:55:44.276216"], ["updated_at", "2016-02-15 22:55:44.276216"]]
---
  def signupValidate
    puts "________--------------------" + params.to_s
    @email = params[:email]
    @password = params[:password]
    @confirm_password = params[:confirm_password]
    if @password.to_s != @confirm_password.to_s
      flash[:notice] = 'Passwords do not match!'
      redirect_to '/logins/signup'
      return
    end
    @model = Student
    returnVal = @model.find_by email: @email
    if returnVal != nil
      flash[:notice] = 'The email you entered is already signed up. Please choose a different email id'
      redirect_to '/logins/signup'
      return
    else
      @stud = Student.create(name: params[:name], email: @email, password: @password)