app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aditya"], ["email", "amuckad@ncsu.edu"], ["password", "1"], ["created_at", "2016-02-13 01:27:48.386896"], ["updated_at", "2016-02-13 01:27:48.386896"]]

  def enroll_course
    @courseListToEnroll = params[:courses_to_be_enrolled]
    @courseListToEnroll.each do |courId|
      @e = Enrollment.create(student_id: session[:current_user_id].to_s, course_id: courId, status: 'PENDING', grade: '')
---
INSERT INTO "enrollments" ("student_id", "course_id", "status", "grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["student_id", 1], ["course_id", 5], ["status", "PENDING"], ["grade", ""], ["created_at", "2016-02-16 06:30:01.358631"], ["updated_at", "2016-02-16 06:30:01.358631"]]